app/Controllers/Guest.php

SELECT *
FROM `comic`
---
    public function index()
    {
        $data['title'] = 'Comic Page';
        $data['comics'] = $this->comicModel->findAll();