app/Models/ComicModel.php

SELECT *
FROM `comic`
WHERE `slug` = 'harry-potter'
 LIMIT 1
---
    public function getComic($slug)
    {
        return $this->where(['slug' => $slug])->first();