app/Models/UserModel.php

SELECT *
FROM `user`
---
    public function getAll()
    {
        return $this->findAll();